<a href="https://colab.research.google.com/github/danielosullivan2007/Teaching/blob/master/Class1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
#TO RUN JUST ONE CELL AT A TIME IN JUPYTER, PRESS CNTRL-ENTER
#TO RUN A SELECTION IN ANACONDA, PRESS f9

#FOR ANY FUNCTION fn, IF YOU WANT TO SEE THE DOCUMENTATION USE help(fn) 

#1. Load our packages 
import pandas as pd #Pandas is the data manipulation package
import glob as glob #A simple package which lets you scan for a fixed file name
import os # allows you to change the working directory. Not needed for jupyter, only Anaconda Spyder

In [0]:
#2. Create a list of numbers and a list of words. 

fruit_list = ["apples", "bananas", "oranges"]
mixed_list  = ["a", 1, "z"]
numbers_list = [1,2,3]

In [0]:
#3. Create a dataframe called df to and put in the three lists
#First, make a list of your lists!

list_of_lists = [fruit_list, mixed_list, numbers_list]
df = pd.DataFrame(list_of_lists)
df

        0        1        2
0  apples  bananas  oranges
1       a        1        z
2       1        2        3

In [0]:
# 4.	Print the first item of the dataframe (fill in the blanks)
#Pandas use the df.iloc( )

df.iloc[0,0]

'apples'

In [0]:
#5.	Make a list of the  fruits “apple”, “banana” and “cherry” . Write a loop to iterate over them.

fruit_list = ["apple", "banana", "cherry"]

for fruit in reversed(fruit_list):
    print (fruit)

cherry
banana
apple

In [0]:
#6.	Write a loop to print the numbers from 1 to 10

for i in range(11):
    print (i)

0
1
2
3
4
5
6
7
8
9
10

In [0]:
#7.	Write an if statement that checks the condition if < 5.	

i=2
if i < 5:
    print (i)

2

In [0]:
#8.	Put the if statement into your loop from 6
for i in range(11):
    if i < 5:
        print (i)

0
1
2
3
4

In [0]:
#9.	Create a list of all the files in a directory
#glob.glob will run in the active directory. If your files are elsewhere, do glob.glob(directory_location + '*.csv' )

files_list  = glob.glob('*.csv')

In [0]:
# 10.	Loop over all the files in a directory, printing out the name of each
for i in files_list:
    print (i)

Titanic2.csv
titanic1.csv

In [0]:
#11.	Read in multiple CSVs from a folder, saving each one as a dataframe
#12.	Merge the CSVs.


#We'll do both steps together in one go here. 



#First, make an empty dataframe
df = pd.DataFrame()
    
#read in each file one by one, then add them to df using     
for i in files_list:
    data_to_add = pd.read_csv(i)
    
    df = df.append(data_to_add)  #WARNING! THIS IS A TRICKY STEP. NOTICE HOW WE HAVE DONE df = df.append()

In [0]:
#13.	Print top 10 rows, bottom 10 rows, and save the column names as a list called columns

df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,543,0,3,"Andersson, Miss. Sigrid Elisabeth",female,11.0,4,2,347082,31.275,NaN,S
1,544,1,2,"Beane, Mr. Edward",male,32.0,1,0,2908,26.000,NaN,S
2,545,0,1,"Douglas, Mr. Walter Donald",male,50.0,1,0,PC 17761,106.425,C86,C
3,546,0,1,"Nicholson, Mr. Arthur Ernest",male,64.0,0,0,693,26.000,NaN,S
4,547,1,2,"Beane, Mrs. Edward (Ethel Clarke)",female,19.0,1,0,2908,26.000,NaN,S

In [0]:
df.tail()

        0        1        2
0  apples  bananas  oranges
1       a        1        z
2       1        2        3

In [0]:
#14.	Get the first row, third column and last element in the dataframe.
#first row
df.iloc[0,:]
y
#third columny
df.iloc[:,2]

# last element
df.iloc[-1,-1]   # -1 gives the last element in Python. This doesn't work in R :(

NameError: name 'y' is not defined